# a = 5    # переменная типа int
# pi = 3.14  # переменная типа float
# s = "Hello, world" # переменная типа  string
# t = True  # переменная типа bool
# print(a)
# print(pi)
# print(s)
# print(t)
# print("передал текст")
# A=2
# B=3
# C=4
# D=5
# A+=2
# B-=2
# C*=2
# D/=2
# print(A, B,)
# print(C)
# print (D)
# a=2
# b=3
# # Ctrl+? ( англ раскл) - закоментировать.разкоментировать
# # g = a/b  # операция деления
# # h = a%b # остаток от деления
# # t = a//b # операция деления на цело
# # k = a**b # возведение в степень
# print (g)
# print (h)
# print (t)
# print(k)
# s =input("Введите число")
# a = int(input("Введите целое число")) # переманная типа int
# pi = float(input("Введите дробное число")) # переменная типа float
# t = bool (input("Введите значение True/False")) # перемення типа bool
# print(s)
# print(a)
# print(pi)
# print(t)
# a = int (input("Введите целое число"))
# b= int (input("Введите целое число"))
# c= input("Введите Ваше имя")
# g = float(input("Введите дробное число"))
#
# print(c)
#
# print (a+b+g)
# import math # перед работой с модулем/библиотекой перед работой ее импортируем
# AB= float (input("Введите одну сторону"))
# AC = float (input("Введите вторю сторону"))
# BC =math.sqrt(AB**2+AC**2) # находим гипотенузу   # функция sqrt () из модуля math
# print (BC)
# S = (AB+AC)/2 # площадь прямоугольного треугольника равно половине площади соответсвующего прямоугольника
# P = AB+AC+BC # периметр равен сумме длин всех сторон
# print(S)
# print(P)
# print("Периметр = ", P, "см")
# print("Площадь =", S)
# создать 4 переменные с типом данных целых чисел, чисел с плавающей точкой,логическим и строковым.
#преобразовать числа в строку
# a=5
# b = 3.4
# c = True
# t = "Привет"
# A= str(a)
# B = str (b)
# C = str (c)
# print(A)
# print(B)
# print(C)
# print(t)
# print(a+b)
# print(A+B)
 # Заддание 4 = запросить у пользователя имя, фамилию и отчество, возраст и город.
# Вывести на экран ФИО в одну строку и возраст
name=input("Введите Ваше имя")
name1=input("Введите Вашу фамилию")
name2=input ("Введите Ваше отчество")
age=input("Введите ваш возраст")
city= input("Введите Ваш город")
print(name,name1,name2)
print(age)
print(city)













