#3.	Создать пустую переменную. Проверить ее на истинность и ложность. Объясните полученный результат.
a=bool(None)  # присваиваем переменной значение None , что дает переменной нейтральное "пустое" значение
               #тип переменной bool имея всего два значения True и False, и проверяет присутсиве элемента в переменной
print(a)

