#7.	Создать список с числами от 1 до 50 используя генератор списков.


mass = []
for i in range (0,50):
    i += 1
    mass.append(i)
print(mass)

