#10.	Вывести на экран числа от 0 до 50, кроме 35.

for i in range(0,51):
   # print(i)
    if i ==35:
        continue
    print(i)
