# №1 Создайте  кортеж с цифрами от 0 до 9 и посчитайте сумму
# a=tuple(range(10))
# print(sum(a))
# №2Выведите статистику частности букв в кортеже
# long_word = ('т', 'т', 'а', 'и', 'и', 'а', 'и',  'и', 'и', 'т', 'т', 'а', 'и', 'и','и', 'и', 'и', 'т', 'и')
# print("Количество повторений буквы т :", long_word.count("т"),"раз","\n","Количество повторений буквы а :", long_word.count("а"),"раз",
# 	  "\n","Количество повторений буквы и :", long_word.count("и"),"раз")

#  №3Допишите скрипт для расчета средней температуры
# Постарайтесь посчитать количество дней на основе week_temp.
# Так наш скрипт сможет работать c данными за любой период
#
# week_temp = (26, 29, 34, 32, 28, 26, 23)
# sum_temp =sum(week_temp)
# days = len(week_temp)
# mean_temp = sum_temp / days
# print(int(mean_temp))
